[
  {
    "id": 1,
    "title": "A Search For Meaning | A Poem",
    "description": "A poetic exploration of life's purpose, grappling with the pursuit of money, knowledge, and happiness.",
    "date": "2019-02-20",
    "pinned": true,
    "content": "<i>Scrutinized life,</i><br>Found too short for living<br>Urge filled within myself<br>To accomplish something<br><br><b>Astounds me!</b><br>What should I seek for?<br>Maybe something that is eternal<br>That calms my raging soul<br><br><b>Money?</b><br>Sounds pleasant, but still volatile<br>Can comfort you for a short time<br>But can't assure a blissful life<br><br><b>Knowledge?</b><br>Never limited to achieve<br>You learn something every interval<br>Till the moment you leave<br><br><b>Happiness?</b><br>Is priceless, can't acquire so easily<br>Life is uncertain<br>Challenging you with misery<br><br>Still mystique for me<br>What should I seek for?<br>But at the moment<br>It's probably the <b>ANSWER!</b><br><br><i>- Raj Panta</i>"
  },
  {
    "id": 2,
    "title": "My Favourite Chess Openings",
    "description": "I, as a chess enthusiast, particularly enjoy these openings because of their strategic depth and the balanced positions they create.",
    "date": "2025-06-15",
    "pinned": false,
    "content": "1. d4 d5 2. Nf3 Nf6 3. Bf4 c6 4. e3 e6<br><br><b>The London System</b> is one of my go-to openings as White. I like it because it offers a flexible and reliable setup, allowing me to develop my pieces naturally and build a solid pawn structure without memorizing long theoretical lines. It's forgiving and provides a good foundation for both aggressive and positional play.<br><br>As Black, the <b>Caro-Kann Defense</b> is my preferred response to 1. e4. I favor it for its resilient and sturdy defensive structure, which often leads to a stable pawn formation and excellent counter-attacking chances. It feels very solid and reliable, giving me confidence in my position.<br><br>The early moves in this game showcase the strategic nuances and tactical possibilities arising from these two beloved openings, making for an engaging and balanced battle."
  },
  {
    "id": 3,
    "title": "My Favorite TV Shows of All Time",
    "description": "These are the shows that've kept me glued to the screen, from heart-pounding dramas to laugh-out-loud comedies. Here's why I love them!",
    "date": "2025-06-10",
    "pinned": false,
    "content": "I'm a huge TV buff, and these shows are my absolute favorites across different genres. Each one's got a special place in my heart:<br><br>- <b>Crime:</b> <span class='text-neon-purple'>Breaking Bad</span> — Man, this show's a rollercoaster! Watching Walter White go from a chemistry teacher to a drug kingpin hooked me from the start.<br><br>- <b>Fantasy:</b> <span class='text-neon-purple'>Game of Thrones</span> — Dragons, betrayals, and epic battles – what's not to love?<br><br>- <b>Horror:</b> <span class='text-neon-purple'>The Haunting of Hill House</span> — This one gave me chills! It's not just scary; it's a deep dive into family trauma and grief.<br><br>- <b>Sci-Fi:</b> <span class='text-neon-purple'>Dark</span> — Time travel done right! This German gem is mind-bending with its complex plot and characters.<br><br>- <b>Sitcom:</b> <span class='text-neon-purple'>The Big Bang Theory</span> — Sheldon's quirks and the gang's nerdy banter never fail to make me laugh.<br><br>- <b>Procedural:</b> <span class='text-neon-purple'>Mindhunter</span> — I'm fascinated by true crime, and this show's dive into serial killer psychology is gripping.<br><br>- <b>Mystery:</b> <span class='text-neon-purple'>Sherlock</span> — Benedict Cumberbatch as Sherlock is iconic. The clever cases and his chemistry with Watson had me binge-watching.<br><br>- <b>Space Sci-Fi:</b> <span class='text-neon-purple'>The Expanse</span> — This is sci-fi at its best – gritty, realistic, and full of political intrigue.<br><br>- <b>Drama:</b> <span class='text-neon-purple'>Anne with an E</span> — Anne's imagination and journey through hardship hit me right in the feels.<br><br>- <b>Suspense:</b> <span class='text-neon-purple'>Behind Her Eyes</span> — Talk about a wild ride! This psychological thriller kept me guessing until the jaw-dropping finale."
  }
]
